---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IFCHybridImport Properties
IFCHybridImport Class See Also Send Feedback
---

The IFCHybridImport type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

IFCHybridImport Class

Autodesk.Revit.DB.IFC Namespace